;===========================================================================
;   RUSTY DETAILED SOLDIER LISTS LOCALISATION
;   CREATED 14/07/22 00:30  UPDATED 18/07/22 01:30
;===========================================================================
[X2EventListener_StatusOfDSLRusty]
strOfficerAlreadySelectedStatus="OFFICER IN SQUAD"
strCommandingOfficer = "OFFICER UNIT"

strSPARKAlreadySelectedStatus="SPARK IN SQUAD"
strSPARKUnit = "SPARK UNIT"

;===========================================================================

[MoreDetailsManager]
m_strToggleDetails="TOGGLE DETAILS"
m_strShowLegend="TOGGLE LEGEND"
m_strLegendTitle="LEGEND"

m_strSection1="1ST PAGE NAMES ICONS"
m_strSection2="1ST PAGE CLASS ICONS"
m_strSection3="2ND PAGE NAMES ICONS"
m_strSection4="2ND PAGE CLASS ICONS"
m_StrSection5="OTHER ICONS"
m_strSectionR="WEAPON ICONS"

m_strShieldsLabel="SHIELDS"
m_strPCSLabel="PCS SLOT"
m_strSPARKLabel="SPARK"

m_strNaturalAptitude="NATURAL APTITUDE"

m_strNaturalAptitudeLabels[0]="Mortal"
m_strNaturalAptitudeLabels[1]="Good Genes"
m_strNaturalAptitudeLabels[2]="Peak Human"
m_strNaturalAptitudeLabels[3]="Super Human"
m_strNaturalAptitudeLabels[4]="Godlike"

m_strSkillPoints="SOLDIER SKILL POINTS"

;===========================================================================
;below is a list of weapon categories to translate for the LEGEND sidebar
;this list can be further expanded in the future with no need for code recompile!

[XGLocalisedData_DSL]

rifle="Rifle"
sniper_rifle="Sniper Rifle"
cannon="Cannon"
shotgun="Shotgun"
gauntlet="Shard Gauntlet"
vektor_rifle="Vektor Rifle"
bullpup="Bullpup"
SMG="SMG"
pistol="Pistol"
sword="Melee Weapon"
gremlin="Gremlin"
grenade_launcher="Grenade Launcher"
claymore="Claymore"
claymoreP="IED"
wristblade="RipJack"
sidearm="Auto Pistol"
psiamp="Psi Amp"
replace_psiamp="Psi Shard"
psiamp_pm="Soul Gem"
sparkrifle="Spark Rifle"
sparkbit="Spark Bit"
spark_shield="Spark Shield"
combatknife="Combat Knife"
arcthrower="Arc Thrower"
holotargeter="Holo Targeter"
lw_gauntlet="XCOM Gauntlet"
lwgauntlet="XCOM Gauntlet"
sawedoffshotgun="Sawed-Off Shotgun"
Heavy="Heavy"
psionicreaper="Psionic Reaper"
psigatlingrifle="Psi Gatling Gun"
empty="Empty"
chemthrower="Chemthrower"
canister="Canister"
iri_ordnance_launcher="Spark Ordnance"
iri_kinetic_strike_module="Kinetic Strike"
iri_rocket_launcher="Rocket Launcher"
iri_disposable_launcher="Disposable Launcher"
shield="Shield"
proxrocket="Proxian Launcher"
proxwristblade="Proxian Blade"
proxpalm="Palm Blaster"
bioamp="Biotic Amp"
stimgun="Stim Gun"
tanklin="Tanklin"
holocron="Holocron"
lightsaber="Light Sabre"
saberstaff="Saber Staff"
necrostaff="Necro Staff"
MysticStaff="Mystic Staff"
glaive="Glaive"
travellight="Travel Light"
teslarifle="Tesla Rifle"
bow="Bow Caster"
boltcaster="Bolt Caster"
